results/bun/vus_50/rep_1/k6_security_stdout.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/security.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 45s max duration (incl. graceful stop):
              * default: 10 looping VUs for 15s (gracefulStop: 30s)


running (01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  01.0s/15s

running (02.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  02.0s/15s

running (03.0s), 10/10 VUs, 258 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  03.0s/15s

running (04.0s), 10/10 VUs, 551 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  04.0s/15s

running (05.0s), 10/10 VUs, 839 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  05.0s/15s

running (06.0s), 10/10 VUs, 1146 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  06.0s/15s

running (07.0s), 10/10 VUs, 1449 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  07.0s/15s

running (08.0s), 10/10 VUs, 1752 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  08.0s/15s

running (09.0s), 10/10 VUs, 2046 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  09.0s/15s

running (10.0s), 10/10 VUs, 2328 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  10.0s/15s

running (11.0s), 10/10 VUs, 2613 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  11.0s/15s

running (12.0s), 10/10 VUs, 2904 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  12.0s/15s

running (13.0s), 10/10 VUs, 3200 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  13.0s/15s

running (14.0s), 10/10 VUs, 3502 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  14.0s/15s

running (15.0s), 10/10 VUs, 3805 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  15.0s/15s


  █ TOTAL RESULTS 

    checks_total.......: 11451   761.815786/s
    checks_succeeded...: 100.00% 11451 out of 11451
    checks_failed......: 0.00%   0 out of 11451

    ✓ net: got 200
    ✓ env: endpoint ok
    ✓ fs: responded

    HTTP
    http_req_duration..............: avg=13.04ms min=96.03µs med=250.86µs max=2.2s p(90)=33.02ms p(95)=38.78ms
      { expected_response:true }...: avg=13.04ms min=96.03µs med=250.86µs max=2.2s p(90)=33.02ms p(95)=38.78ms
    http_req_failed................: 0.00%  0 out of 11451
    http_reqs......................: 11451  761.815786/s

    EXECUTION
    iteration_duration.............: avg=39.32ms min=25.89ms med=30.88ms  max=2.2s p(90)=44.86ms p(95)=55.23ms
    iterations.....................: 3817   253.938595/s
    vus............................: 10     min=10         max=10
    vus_max........................: 10     min=10         max=10

    NETWORK
    data_received..................: 2.4 MB 161 kB/s
    data_sent......................: 889 kB 59 kB/s



running (15.0s), 00/10 VUs, 3817 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  15s